#!/usr/bin/env python3
# -*- coding: utf-8 -*-
'''
L[0:3]表示，从索引0开始取，直到索引3为止，但不包括索引3。即索引0，1，2，正好是3个元素。
如果第一个索引是0，还可以省略：
也可以从索引1开始，取出2个元素出来
所有数，每5个取一个：
 L[::5]
[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]
'''
l=['1','2','3']
print(l[0:2])
print(l[:2])
print(l[-1])
#['1', '2']
L=list(range(100))
print(L)
print(L[78:-10])
b=L[:]
print(b)
print(L[::5])
print(L[:10:2])
print(L[::5])
str='百度是个厉害的公司'
print(str[0:len(str)])
'''
print str[0:3] #截取第一位到第三位的字符
print str[:] #截取字符串的全部字符
print str[6:] #截取第七个字符到结尾
print str[:-3] #截取从头开始到倒数第三个字符之前
print str[2] #截取第三个字符
print str[-1] #截取倒数第一个字符
print str[::-1] #创造一个与原字符串顺序相反的字符串
print str[-3:-1] #截取倒数第三位与倒数第一位之前的字符
print str[-3:] #截取倒数第三位到结尾
print str[:-5:-3] #逆序截取
'''
str=[1,2,3,4,5,6,7]
print(str[-5:-1])#[3, 4, 5, 6]
print(str[-1])#7
print (str[:-5:-1])